In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame( {
    "id": [1001, 1002, 1003, 1004, 1005, 1006],
    "date": pd.date_range(20130102, periods=6),
    "city": ['beijing', 'SH', 'guangzhou', 'shenzhen', 'shagnhai', 'beijing'],
    "age": [23,44, 54, 32, 34, 32],
    "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
    "price":[1200,np.nan,2133,5433,np.nan,4432]},
    columns =['id','date','city','category','age','price']
)

In [3]:
df

     id                          date       city category  age   price
0  1001 1970-01-01 00:00:00.020130102    beijing    100-A   23  1200.0
1  1002 1970-01-02 00:00:00.020130102         SH    100-B   44     NaN
2  1003 1970-01-03 00:00:00.020130102  guangzhou    110-A   54  2133.0
3  1004 1970-01-04 00:00:00.020130102   shenzhen    110-C   32  5433.0
4  1005 1970-01-05 00:00:00.020130102   shagnhai    210-A   34     NaN
5  1006 1970-01-06 00:00:00.020130102    beijing    130-F   32  4432.0

In [4]:
df.shape

(6, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes

In [13]:
df.dtypes

id                   int64
date        datetime64[ns]
city                object
category            object
age                  int64
price              float64
dtype: object

In [14]:
df['age'].dtype

dtype('int64')

In [15]:
df.isnull()

      id   date   city  category    age  price
0  False  False  False     False  False  False
1  False  False  False     False  False   True
2  False  False  False     False  False  False
3  False  False  False     False  False  False
4  False  False  False     False  False   True
5  False  False  False     False  False  False

In [16]:
df['age'].unique()

array([23, 44, 54, 32, 34])

In [17]:
df.values

array([[1001, Timestamp('1970-01-01 00:00:00.020130102'), 'beijing',
        '100-A', 23, 1200.0],
       [1002, Timestamp('1970-01-02 00:00:00.020130102'), 'SH', '100-B',
        44, nan],
       [1003, Timestamp('1970-01-03 00:00:00.020130102'), 'guangzhou',
        '110-A', 54, 2133.0],
       [1004, Timestamp('1970-01-04 00:00:00.020130102'), 'shenzhen',
        '110-C', 32, 5433.0],
       [1005, Timestamp('1970-01-05 00:00:00.020130102'), 'shagnhai',
        '210-A', 34, nan],
       [1006, Timestamp('1970-01-06 00:00:00.020130102'), 'beijing',
        '130-F', 32, 4432.0]], dtype=object)

In [18]:
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

In [22]:
df['city'].replace('SH', 'SHANGHAI')

0      beijing
1     SHANGHAI
2    guangzhou
3     shenzhen
4     shagnhai
5      beijing
Name: city, dtype: object

In [23]:
df

     id                          date       city category  age   price
0  1001 1970-01-01 00:00:00.020130102    beijing    100-A   23  1200.0
1  1002 1970-01-02 00:00:00.020130102         SH    100-B   44     NaN
2  1003 1970-01-03 00:00:00.020130102  guangzhou    110-A   54  2133.0
3  1004 1970-01-04 00:00:00.020130102   shenzhen    110-C   32  5433.0
4  1005 1970-01-05 00:00:00.020130102   shagnhai    210-A   34     NaN
5  1006 1970-01-06 00:00:00.020130102    beijing    130-F   32  4432.0

In [44]:
df1 = pd.DataFrame({
    "code": ['123', '456', '789'],
    "rpsValue": [99, 98, 43]
})
df2 = pd.DataFrame({
    "code": ['123', '456', '789'],
    "rpsValue": [99, 98, 90]
})
df3 = pd.DataFrame({
    "code": ['123', '456', '789'],
    "rpsValue": [99, 98, 43]
})

In [45]:
#df1['rpsValue'] > 90
df1 = df1[df1['rpsValue'] > 90]
print(df1)
df2 = df2[df2['rpsValue'] > 90]
print(df2)
df3 = df3[df3['rpsValue'] > 98]
print(df3)
#df1.filter(df1['rpsValue']> 90)

  code  rpsValue
0  123        99
1  456        98
  code  rpsValue
0  123        99
1  456        98
  code  rpsValue
0  123        99

In [47]:
df1.columns=['code', 'rps120']
df2.columns=['code', 'rps250']
df3.columns=['code', 'rps50']
print(df1)
print(df2)
print(df3)

  code  rps120
0  123      99
1  456      98
  code  rps250
0  123      99
1  456      98
  code  rps50
0  123     99

In [51]:
res = pd.merge(df1, df3, on='code')
print(res)

  code  rps120  rps50
0  123      99     99

In [54]:
round(1.56)

2